# GetLossFactor Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightType..::..GetLossFactor Method
LightType Class See Also
---
Return a copy of an object derived from LossFactor
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public LossFactor GetLossFactor()
```

Visual Basic
---
```text
Public Function GetLossFactor As LossFactor
```

Visual C++
---
```text
public:
LossFactor^ GetLossFactor()
```

# See Also
LightType Class
Autodesk.Revit.DB.Lighting Namespace